InformationRegisters/ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПрочитатьУстановитьПараметры();
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Изменен")
		И Параметры.ЗначенияЗаполнения.Изменен Тогда
		Элементы.Изменен.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Параметры.ЗначенияЗаполнения.Свойство("ЭлементКонструктора")
		И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.ЭлементКонструктора) Тогда
		Элементы.ЭлементКонструктора.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЭлементКонструктораПриИзменении(Элемент)
	
	ПрочитатьУстановитьПараметры();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьУстановитьПараметры()
	
	ПараметрыЭлемента = Справочники.ЭлементыКонструктораВидовПродукцииИС.ПараметрыЭлементаКонструктора(Запись.ЭлементКонструктора);
	
	Элементы.Значение.ОграничениеТипа = ПараметрыЭлемента.ТипЗначения;
	
	Если ПараметрыЭлемента.Параметризуется
		И ПараметрыЭлемента.ТипЗначения.Типы().Найти(Тип("Дата")) <> Неопределено
		И ПараметрыЭлемента.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
		Элементы.Значение.Формат = "ДФ=dd.MM.yyyy;";
		Элементы.Значение.ФорматРедактирования = "ДФ=dd.MM.yyyy;";
	КонецЕсли;
	
	Элементы.Значение.Доступность = ПараметрыЭлемента.Параметризуется;
	
	Если Не ПараметрыЭлемента.Параметризуется Тогда
		Запись.Значение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
